MikroElektronika/core_packages/ARM/gcc_clang/def/ti/MSPM0G1519/mcu.h
/******************************************************************************
* SYS parameters                                                              *
******************************************************************************/

#define DMA_SYS_N_DMA_CHANNEL                         (12)      /* !< Number of DMA channels implemented in DMA. */
#define DMA_SYS_N_DMA_FULL_CHANNEL                    (6)       /* !< Number of FULL-DMA channels implemented in DMA. */
#define DMA_SYS_MMR_AUTO                              (1)       /* !< Boolean for if auto enable channels implemented in DMA. */
#define DMA_SYS_MMR_EM                                (1)       /* !< Boolean for if extended mode channels implemented in DMA. */
#define DMA_SYS_MMR_LLONG                             (1)       /* !< Boolean for if channels implemented in DMA with 128-bit access. */
#define DMA_SYS_MMR_STRIDE                            (1)       /* !< Boolean for if channels implemented in DMA with stride mode. */
#define FLASHCTL_SYS_DATAWIDTH                        (64)      /* !< Data bit width of a single flash word. */
#define ADC_SYS_NUM_ANALOG_CHAN                       (16)      /* !< Number of analog channels. */
#define I2C_SYS_FENTRIES                              (8)       /* !< Number of FIFO entries */
#define FLASHCTL_SYS_WEPROTAWIDTH                     (0)       /* !< Bit width of WEPROTA register */
#define FLASHCTL_SYS_WEPROTBWIDTH                     (32)      /* !< Bit width of WEPROTB register */
#define FLASHCTL_SYS_WEPROTCWIDTH                     (0)       /* !< Bit width of WEPROTC register */

/******************************************************************************
* DMA Triggers                                                                *
******************************************************************************/

/* External DMA Triggers */
#define DMA_SOFTWARE_TRIG                             (0)
#define DMA_GENERIC_SUB0_TRIG                         (1)
#define DMA_GENERIC_SUB1_TRIG                         (2)
#define DMA_AESADV_AES_0_TRIG                         (3)
#define DMA_AESADV_AES_1_TRIG                         (4)
#define DMA_DAC0_EVT_BD_1_TRIG                        (5)
#define DMA_I2C0_TX_TRIG                              (6)
#define DMA_I2C0_RX_TRIG                              (7)
#define DMA_I2C1_TX_TRIG                              (8)
#define DMA_I2C1_RX_TRIG                              (9)
#define DMA_I2C2_TX_TRIG                              (10)
#define DMA_I2C2_RX_TRIG                              (11)
#define DMA_SPI0_RX_TRIG                              (12)
#define DMA_SPI0_TX_TRIG                              (13)
#define DMA_SPI1_RX_TRIG                              (14)
#define DMA_SPI1_TX_TRIG                              (15)
#define DMA_SPI2_RX_TRIG                              (16)
#define DMA_SPI2_TX_TRIG                              (17)
#define DMA_UART3_RX_TRIG                             (18)
#define DMA_UART3_TX_TRIG                             (19)
#define DMA_UART4_RX_TRIG                             (20)
#define DMA_UART4_TX_TRIG                             (21)
#define DMA_UART5_RX_TRIG                             (22)
#define DMA_UART5_TX_TRIG                             (23)
#define DMA_UART6_RX_TRIG                             (24)
#define DMA_UART6_TX_TRIG                             (25)
#define DMA_UART0_RX_TRIG                             (26)
#define DMA_UART0_TX_TRIG                             (27)
#define DMA_UART7_RX_TRIG                             (28)
#define DMA_UART7_TX_TRIG                             (29)
#define DMA_UART1_RX_TRIG                             (30)
#define DMA_UART1_TX_TRIG                             (31)
#define DMA_ADC0_EVT_GEN_BD_TRIG                      (32)
#define DMA_ADC1_EVT_GEN_BD_TRIG                      (33)

/* Internal DMA Triggers */
#define DMA_CH_0_TRIG                                 (0)
#define DMA_CH_1_TRIG                                 (1)
#define DMA_CH_2_TRIG                                 (2)
#define DMA_CH_3_TRIG                                 (3)
#define DMA_CH_4_TRIG                                 (4)
#define DMA_CH_5_TRIG                                 (5)
#define DMA_CH_6_TRIG                                 (6)
#define DMA_CH_7_TRIG                                 (7)
#define DMA_CH_8_TRIG                                 (8)
#define DMA_CH_9_TRIG                                 (9)
#define DMA_CH_10_TRIG                                (10)
#define DMA_CH_11_TRIG                                (11)


/******************************************************************************
* IOMUX Pin Definitions                                                       *
******************************************************************************/

typedef enum IOMUX_PINCM
{
  IOMUX_PINCM1         = (0),
  IOMUX_PINCM2         = (1),
  IOMUX_PINCM3         = (2),
  IOMUX_PINCM4         = (3),
  IOMUX_PINCM5         = (4),
  IOMUX_PINCM6         = (5),
  IOMUX_PINCM7         = (6),
  IOMUX_PINCM8         = (7),
  IOMUX_PINCM9         = (8),
  IOMUX_PINCM10        = (9),
  IOMUX_PINCM11        = (10),
  IOMUX_PINCM12        = (11),
  IOMUX_PINCM13        = (12),
  IOMUX_PINCM14        = (13),
  IOMUX_PINCM15        = (14),
  IOMUX_PINCM16        = (15),
  IOMUX_PINCM17        = (16),
  IOMUX_PINCM18        = (17),
  IOMUX_PINCM19        = (18),
  IOMUX_PINCM20        = (19),
  IOMUX_PINCM21        = (20),
  IOMUX_PINCM22        = (21),
  IOMUX_PINCM23        = (22),
  IOMUX_PINCM24        = (23),
  IOMUX_PINCM25        = (24),
  IOMUX_PINCM26        = (25),
  IOMUX_PINCM27        = (26),
  IOMUX_PINCM28        = (27),
  IOMUX_PINCM29        = (28),
  IOMUX_PINCM30        = (29),
  IOMUX_PINCM31        = (30),
  IOMUX_PINCM32        = (31),
  IOMUX_PINCM33        = (32),
  IOMUX_PINCM34        = (33),
  IOMUX_PINCM35        = (34),
  IOMUX_PINCM36        = (35),
  IOMUX_PINCM37        = (36),
  IOMUX_PINCM38        = (37),
  IOMUX_PINCM39        = (38),
  IOMUX_PINCM40        = (39),
  IOMUX_PINCM41        = (40),
  IOMUX_PINCM42        = (41),
  IOMUX_PINCM43        = (42),
  IOMUX_PINCM44        = (43),
  IOMUX_PINCM45        = (44),
  IOMUX_PINCM46        = (45),
  IOMUX_PINCM47        = (46),
  IOMUX_PINCM48        = (47),
  IOMUX_PINCM49        = (48),
  IOMUX_PINCM50        = (49),
  IOMUX_PINCM51        = (50),
  IOMUX_PINCM52        = (51),
  IOMUX_PINCM53        = (52),
  IOMUX_PINCM54        = (53),
  IOMUX_PINCM55        = (54),
  IOMUX_PINCM56        = (55),
  IOMUX_PINCM57        = (56),
  IOMUX_PINCM58        = (57),
  IOMUX_PINCM59        = (58),
  IOMUX_PINCM60        = (59),
  IOMUX_PINCM61        = (60),
  IOMUX_PINCM62        = (61),
  IOMUX_PINCM63        = (62),
  IOMUX_PINCM64        = (63),
  IOMUX_PINCM65        = (64),
  IOMUX_PINCM66        = (65),
  IOMUX_PINCM67        = (66),
  IOMUX_PINCM68        = (67),
  IOMUX_PINCM69        = (68),
  IOMUX_PINCM70        = (69),
  IOMUX_PINCM71        = (70),
  IOMUX_PINCM72        = (71),
  IOMUX_PINCM73        = (72),
  IOMUX_PINCM74        = (73),
  IOMUX_PINCM75        = (74),
  IOMUX_PINCM76        = (75),
  IOMUX_PINCM77        = (76),
  IOMUX_PINCM78        = (77),
  IOMUX_PINCM79        = (78),
  IOMUX_PINCM80        = (79),
  IOMUX_PINCM81        = (80),
  IOMUX_PINCM82        = (81),
  IOMUX_PINCM83        = (82),
  IOMUX_PINCM84        = (83),
  IOMUX_PINCM85        = (84),
  IOMUX_PINCM86        = (85),
  IOMUX_PINCM87        = (86),
  IOMUX_PINCM88        = (87),
  IOMUX_PINCM89        = (88),
  IOMUX_PINCM90        = (89),
  IOMUX_PINCM91        = (90),
  IOMUX_PINCM92        = (91),
  IOMUX_PINCM93        = (92),
  IOMUX_PINCM94        = (93),
} IOMUX_PINCM;


/* IOMUX_PINCM1[PF] Bits */
#define IOMUX_PINCM1_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM1_PF_GPIOA_DIO00                   ((uint32_t)0X00000001)
#define IOMUX_PINCM1_PF_UART0_TX                      ((uint32_t)0X00000002)
#define IOMUX_PINCM1_PF_I2C0_SDA                      ((uint32_t)0X00000003)
#define IOMUX_PINCM1_PF_TIMA0_CCP0                    ((uint32_t)0X00000004)
#define IOMUX_PINCM1_PF_TIMA_FAULT1                   ((uint32_t)0X00000005)
#define IOMUX_PINCM1_PF_SYSCTL_FCC_IN                 ((uint32_t)0X00000006)
#define IOMUX_PINCM1_PF_TIMG8_CCP1                    ((uint32_t)0X00000007)
#define IOMUX_PINCM1_PF_TIMG12_CCP0                   ((uint32_t)0X00000008)
#define IOMUX_PINCM1_PF_TIMG0_CCP0                    ((uint32_t)0X00000009)
#define IOMUX_PINCM1_PF_UART5_RX                      ((uint32_t)0X0000000C)

/* IOMUX_PINCM2[PF] Bits */
#define IOMUX_PINCM2_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM2_PF_GPIOA_DIO01                   ((uint32_t)0X00000001)
#define IOMUX_PINCM2_PF_UART0_RX                      ((uint32_t)0X00000002)
#define IOMUX_PINCM2_PF_I2C0_SCL                      ((uint32_t)0X00000003)
#define IOMUX_PINCM2_PF_TIMA0_CCP1                    ((uint32_t)0X00000004)
#define IOMUX_PINCM2_PF_TIMA_FAULT2                   ((uint32_t)0X00000005)
#define IOMUX_PINCM2_PF_TIMG8_IDX                     ((uint32_t)0X00000006)
#define IOMUX_PINCM2_PF_TIMG8_CCP0                    ((uint32_t)0X00000007)
#define IOMUX_PINCM2_PF_TIMG12_CCP1                   ((uint32_t)0X00000008)
#define IOMUX_PINCM2_PF_TIMG0_CCP1                    ((uint32_t)0X00000009)
#define IOMUX_PINCM2_PF_SPI0_CS3_CD_POCI3             ((uint32_t)0X0000000A)
#define IOMUX_PINCM2_PF_UART5_TX                      ((uint32_t)0X0000000C)

/* IOMUX_PINCM3[PF] Bits */
#define IOMUX_PINCM3_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM3_PF_GPIOA_DIO28                   ((uint32_t)0X00000001)
#define IOMUX_PINCM3_PF_UART0_TX                      ((uint32_t)0X00000002)
#define IOMUX_PINCM3_PF_I2C0_SDA                      ((uint32_t)0X00000003)
#define IOMUX_PINCM3_PF_TIMA0_CCP3                    ((uint32_t)0X00000004)
#define IOMUX_PINCM3_PF_TIMA_FAULT0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM3_PF_TIMA0_CCP1                    ((uint32_t)0X00000007)
#define IOMUX_PINCM3_PF_TIMA1_CCP0                    ((uint32_t)0X00000009)
#define IOMUX_PINCM3_PF_TIMG14_CCP2                   ((uint32_t)0X0000000A)
#define IOMUX_PINCM3_PF_TIMG7_CCP0                    ((uint32_t)0X0000000B)
#define IOMUX_PINCM3_PF_UART5_CTS                     ((uint32_t)0X0000000C)

/* IOMUX_PINCM4[PF] Bits */
#define IOMUX_PINCM4_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM4_PF_GPIOA_DIO29                   ((uint32_t)0X00000001)
#define IOMUX_PINCM4_PF_I2C1_SCL                      ((uint32_t)0X00000002)
#define IOMUX_PINCM4_PF_UART7_RTS                     ((uint32_t)0X00000003)
#define IOMUX_PINCM4_PF_TIMG8_CCP0                    ((uint32_t)0X00000004)
#define IOMUX_PINCM4_PF_I2C2_SCL                      ((uint32_t)0X00000006)
#define IOMUX_PINCM4_PF_UART0_CTS                     ((uint32_t)0X00000007)
#define IOMUX_PINCM4_PF_SPI0_CS3_CD_POCI3             ((uint32_t)0X00000008)
#define IOMUX_PINCM4_PF_TIMG6_CCP0                    ((uint32_t)0X00000009)
#define IOMUX_PINCM4_PF_TIMG14_CCP3                   ((uint32_t)0X0000000A)
#define IOMUX_PINCM4_PF_TIMG14_CCP0                   ((uint32_t)0X0000000B)
#define IOMUX_PINCM4_PF_UART5_RTS                     ((uint32_t)0X0000000C)

/* IOMUX_PINCM5[PF] Bits */
#define IOMUX_PINCM5_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM5_PF_GPIOA_DIO30                   ((uint32_t)0X00000001)
#define IOMUX_PINCM5_PF_I2C1_SDA                      ((uint32_t)0X00000002)
#define IOMUX_PINCM5_PF_UART7_CTS                     ((uint32_t)0X00000003)
#define IOMUX_PINCM5_PF_TIMG8_CCP1                    ((uint32_t)0X00000004)
#define IOMUX_PINCM5_PF_I2C2_SDA                      ((uint32_t)0X00000006)
#define IOMUX_PINCM5_PF_UART0_RTS                     ((uint32_t)0X00000007)
#define IOMUX_PINCM5_PF_SPI0_CS2_POCI2                ((uint32_t)0X00000008)
#define IOMUX_PINCM5_PF_TIMG6_CCP1                    ((uint32_t)0X00000009)
#define IOMUX_PINCM5_PF_TIMG14_CCP1                   ((uint32_t)0X0000000B)

/* IOMUX_PINCM6[PF] Bits */
#define IOMUX_PINCM6_PF_UNCONNECTED                   ((uint32_t)0X00000000)
#define IOMUX_PINCM6_PF_GPIOA_DIO31                   ((uint32_t)0X00000001)
#define IOMUX_PINCM6_PF_UART0_RX                      ((uint32_t)0X00000002)
#define IOMUX_PINCM6_PF_I2C0_SCL                      ((uint32_t)0X00000003)
#define IOMUX_PINCM6_PF_TIMA0_CCP3_CMPL               ((uint32_t)0X00000004)
#define IOMUX_PINCM6_PF_TIMG12_CCP1                   ((uint32_t)0X00000005)
#define IOMUX_PINCM6_PF_SYSCTL_CLK_OUT                ((uint32_t)0X00000006)
#define IOMUX_PINCM6_PF_SPI0_CS3_CD_POCI3             ((uint32_t)0X00000008)
#define IOMUX_PINCM6_PF_TIMG7_CCP1                    ((uint32_t)0X00000009)
#define IOMUX_PINCM6_PF_TIMA1_CCP1                    ((uint32_t)0X0000000B)

