MikroElektronika/core_packages/ARM/gcc_clang/def/ti/MSPM0G1519/mcu.h
/* IOMUX_PINCM28[PF] Bits */
#define IOMUX_PINCM28_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM28_PF_GPIOB_DIO11                  ((uint32_t)0X00000001)
#define IOMUX_PINCM28_PF_TIMG0_CCP1                   ((uint32_t)0X00000002)
#define IOMUX_PINCM28_PF_TIMG8_CCP1                   ((uint32_t)0X00000003)
#define IOMUX_PINCM28_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000004)
#define IOMUX_PINCM28_PF_UART4_RX                     ((uint32_t)0X00000006)
#define IOMUX_PINCM28_PF_SPI1_CS2_POCI2               ((uint32_t)0X00000007)
#define IOMUX_PINCM28_PF_TIMG6_CCP1                   ((uint32_t)0X00000009)

/* IOMUX_PINCM29[PF] Bits */
#define IOMUX_PINCM29_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM29_PF_GPIOB_DIO12                  ((uint32_t)0X00000001)
#define IOMUX_PINCM29_PF_UART3_TX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM29_PF_TIMA0_CCP2                   ((uint32_t)0X00000003)
#define IOMUX_PINCM29_PF_TIMA_FAULT1                  ((uint32_t)0X00000004)
#define IOMUX_PINCM29_PF_TIMA0_CCP1                   ((uint32_t)0X00000005)
#define IOMUX_PINCM29_PF_UART4_CTS                    ((uint32_t)0X00000006)
#define IOMUX_PINCM29_PF_SPI1_CS1_POCI1               ((uint32_t)0X00000007)
#define IOMUX_PINCM29_PF_TIMG14_CCP0                  ((uint32_t)0X0000000A)

/* IOMUX_PINCM30[PF] Bits */
#define IOMUX_PINCM30_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM30_PF_GPIOB_DIO13                  ((uint32_t)0X00000001)
#define IOMUX_PINCM30_PF_UART3_RX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM30_PF_TIMA0_CCP3                   ((uint32_t)0X00000003)
#define IOMUX_PINCM30_PF_TIMG12_CCP0                  ((uint32_t)0X00000004)
#define IOMUX_PINCM30_PF_TIMA0_CCP1_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM30_PF_UART4_RTS                    ((uint32_t)0X00000006)
#define IOMUX_PINCM30_PF_SPI1_CS0                     ((uint32_t)0X00000007)
#define IOMUX_PINCM30_PF_TIMG14_CCP1                  ((uint32_t)0X0000000A)

/* IOMUX_PINCM31[PF] Bits */
#define IOMUX_PINCM31_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM31_PF_GPIOB_DIO14                  ((uint32_t)0X00000001)
#define IOMUX_PINCM31_PF_SPI1_CS3_CD_POCI3            ((uint32_t)0X00000002)
#define IOMUX_PINCM31_PF_SPI1_POCI                    ((uint32_t)0X00000003)
#define IOMUX_PINCM31_PF_TIMG12_CCP1                  ((uint32_t)0X00000004)
#define IOMUX_PINCM31_PF_TIMA0_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM31_PF_TIMG8_IDX                    ((uint32_t)0X00000006)
#define IOMUX_PINCM31_PF_SPI0_CS3_CD_POCI3            ((uint32_t)0X00000007)

/* IOMUX_PINCM32[PF] Bits */
#define IOMUX_PINCM32_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM32_PF_GPIOB_DIO15                  ((uint32_t)0X00000001)
#define IOMUX_PINCM32_PF_UART7_TX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM32_PF_SPI1_PICO                    ((uint32_t)0X00000003)
#define IOMUX_PINCM32_PF_UART3_CTS                    ((uint32_t)0X00000004)
#define IOMUX_PINCM32_PF_TIMG8_CCP0                   ((uint32_t)0X00000005)
#define IOMUX_PINCM32_PF_I2C2_SCL                     ((uint32_t)0X00000007)
#define IOMUX_PINCM32_PF_TIMG7_CCP0                   ((uint32_t)0X0000000B)

/* IOMUX_PINCM33[PF] Bits */
#define IOMUX_PINCM33_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM33_PF_GPIOB_DIO16                  ((uint32_t)0X00000001)
#define IOMUX_PINCM33_PF_UART7_RX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM33_PF_SPI1_SCLK                    ((uint32_t)0X00000003)
#define IOMUX_PINCM33_PF_UART3_RTS                    ((uint32_t)0X00000004)
#define IOMUX_PINCM33_PF_TIMG8_CCP1                   ((uint32_t)0X00000005)
#define IOMUX_PINCM33_PF_I2C2_SDA                     ((uint32_t)0X00000007)
#define IOMUX_PINCM33_PF_TIMG7_CCP1                   ((uint32_t)0X0000000B)

/* IOMUX_PINCM34[PF] Bits */
#define IOMUX_PINCM34_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM34_PF_GPIOA_DIO12                  ((uint32_t)0X00000001)
#define IOMUX_PINCM34_PF_UART3_CTS                    ((uint32_t)0X00000002)
#define IOMUX_PINCM34_PF_SPI0_SCLK                    ((uint32_t)0X00000003)
#define IOMUX_PINCM34_PF_COMP0_OUT                    ((uint32_t)0X00000004)
#define IOMUX_PINCM34_PF_TIMA0_CCP3                   ((uint32_t)0X00000005)
#define IOMUX_PINCM34_PF_SYSCTL_FCC_IN                ((uint32_t)0X00000006)
#define IOMUX_PINCM34_PF_TIMG0_CCP0                   ((uint32_t)0X00000007)
#define IOMUX_PINCM34_PF_SPI1_CS1_POCI1               ((uint32_t)0X00000008)
#define IOMUX_PINCM34_PF_SPI0_CS1_POCI1               ((uint32_t)0X00000009)
#define IOMUX_PINCM34_PF_UART7_CTS                    ((uint32_t)0X0000000A)
#define IOMUX_PINCM34_PF_UART1_CTS                    ((uint32_t)0X0000000B)
#define IOMUX_PINCM34_PF_CANFD0_CANTX                 ((uint32_t)0X0000000C)

/* IOMUX_PINCM35[PF] Bits */
#define IOMUX_PINCM35_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM35_PF_GPIOA_DIO13                  ((uint32_t)0X00000001)
#define IOMUX_PINCM35_PF_UART3_RTS                    ((uint32_t)0X00000002)
#define IOMUX_PINCM35_PF_SPI0_POCI                    ((uint32_t)0X00000003)
#define IOMUX_PINCM35_PF_UART3_RX                     ((uint32_t)0X00000004)
#define IOMUX_PINCM35_PF_TIMA0_CCP3_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM35_PF_LFSS_RTC_OUT                 ((uint32_t)0X00000006)
#define IOMUX_PINCM35_PF_TIMG0_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM35_PF_SPI1_CS0                     ((uint32_t)0X00000008)
#define IOMUX_PINCM35_PF_SPI0_CS3_CD_POCI3            ((uint32_t)0X00000009)
#define IOMUX_PINCM35_PF_UART7_TX                     ((uint32_t)0X0000000A)
#define IOMUX_PINCM35_PF_UART1_RTS                    ((uint32_t)0X0000000B)
#define IOMUX_PINCM35_PF_CANFD0_CANRX                 ((uint32_t)0X0000000C)

/* IOMUX_PINCM36[PF] Bits */
#define IOMUX_PINCM36_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM36_PF_GPIOA_DIO14                  ((uint32_t)0X00000001)
#define IOMUX_PINCM36_PF_UART0_CTS                    ((uint32_t)0X00000002)
#define IOMUX_PINCM36_PF_SPI0_PICO                    ((uint32_t)0X00000003)
#define IOMUX_PINCM36_PF_UART3_TX                     ((uint32_t)0X00000004)
#define IOMUX_PINCM36_PF_TIMG12_CCP0                  ((uint32_t)0X00000005)
#define IOMUX_PINCM36_PF_SYSCTL_CLK_OUT               ((uint32_t)0X00000006)
#define IOMUX_PINCM36_PF_TIMG12_CCP1                  ((uint32_t)0X00000007)
#define IOMUX_PINCM36_PF_SPI1_CS2_POCI2               ((uint32_t)0X00000008)
#define IOMUX_PINCM36_PF_SPI0_CS2_POCI2               ((uint32_t)0X00000009)
#define IOMUX_PINCM36_PF_UART7_RX                     ((uint32_t)0X0000000A)

/* IOMUX_PINCM37[PF] Bits */
#define IOMUX_PINCM37_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM37_PF_GPIOA_DIO15                  ((uint32_t)0X00000001)
#define IOMUX_PINCM37_PF_UART0_RTS                    ((uint32_t)0X00000002)
#define IOMUX_PINCM37_PF_SPI1_CS2_POCI2               ((uint32_t)0X00000003)
#define IOMUX_PINCM37_PF_I2C1_SCL                     ((uint32_t)0X00000004)
#define IOMUX_PINCM37_PF_TIMA0_CCP2                   ((uint32_t)0X00000005)
#define IOMUX_PINCM37_PF_I2C2_SCL                     ((uint32_t)0X00000006)
#define IOMUX_PINCM37_PF_TIMG8_IDX                    ((uint32_t)0X00000007)
#define IOMUX_PINCM37_PF_TIMG12_CCP0                  ((uint32_t)0X00000008)
#define IOMUX_PINCM37_PF_TIMA1_CCP0_CMPL              ((uint32_t)0X00000009)
#define IOMUX_PINCM37_PF_UART7_RTS                    ((uint32_t)0X0000000A)
#define IOMUX_PINCM37_PF_TIMA1_CCP0                   ((uint32_t)0X0000000B)

/* IOMUX_PINCM38[PF] Bits */
#define IOMUX_PINCM38_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM38_PF_GPIOA_DIO16                  ((uint32_t)0X00000001)
#define IOMUX_PINCM38_PF_COMP0_OUT                    ((uint32_t)0X00000002)
#define IOMUX_PINCM38_PF_SPI1_POCI                    ((uint32_t)0X00000003)
#define IOMUX_PINCM38_PF_I2C1_SDA                     ((uint32_t)0X00000004)
#define IOMUX_PINCM38_PF_TIMA0_CCP2_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM38_PF_I2C2_SDA                     ((uint32_t)0X00000006)
#define IOMUX_PINCM38_PF_SYSCTL_FCC_IN                ((uint32_t)0X00000007)
#define IOMUX_PINCM38_PF_TIMG12_CCP1                  ((uint32_t)0X00000008)
#define IOMUX_PINCM38_PF_COMP2_OUT                    ((uint32_t)0X00000009)
#define IOMUX_PINCM38_PF_UART7_CTS                    ((uint32_t)0X0000000A)
#define IOMUX_PINCM38_PF_TIMA1_CCP1                   ((uint32_t)0X0000000B)
#define IOMUX_PINCM38_PF_TIMA1_CCP1_CMPL              ((uint32_t)0X0000000C)

/* IOMUX_PINCM39[PF] Bits */
#define IOMUX_PINCM39_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM39_PF_GPIOA_DIO17                  ((uint32_t)0X00000001)
#define IOMUX_PINCM39_PF_UART1_TX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM39_PF_SPI1_SCLK                    ((uint32_t)0X00000003)
#define IOMUX_PINCM39_PF_I2C1_SCL                     ((uint32_t)0X00000004)
#define IOMUX_PINCM39_PF_TIMA0_CCP3                   ((uint32_t)0X00000005)
#define IOMUX_PINCM39_PF_TIMG8_CCP0                   ((uint32_t)0X00000007)
#define IOMUX_PINCM39_PF_TIMG12_CCP0                  ((uint32_t)0X00000008)
#define IOMUX_PINCM39_PF_SPI0_CS1_POCI1               ((uint32_t)0X00000009)
#define IOMUX_PINCM39_PF_TIMA1_CCP0                   ((uint32_t)0X0000000A)
#define IOMUX_PINCM39_PF_TIMG7_CCP0                   ((uint32_t)0X0000000B)

/* IOMUX_PINCM40[PF] Bits */
#define IOMUX_PINCM40_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM40_PF_GPIOA_DIO18                  ((uint32_t)0X00000001)
#define IOMUX_PINCM40_PF_UART1_RX                     ((uint32_t)0X00000002)
#define IOMUX_PINCM40_PF_SPI1_PICO                    ((uint32_t)0X00000003)
#define IOMUX_PINCM40_PF_I2C1_SDA                     ((uint32_t)0X00000004)
#define IOMUX_PINCM40_PF_TIMA0_CCP3_CMPL              ((uint32_t)0X00000005)
#define IOMUX_PINCM40_PF_TIMG8_CCP1                   ((uint32_t)0X00000007)
#define IOMUX_PINCM40_PF_TIMG12_CCP1                  ((uint32_t)0X00000008)
#define IOMUX_PINCM40_PF_SPI0_CS0                     ((uint32_t)0X00000009)
#define IOMUX_PINCM40_PF_TIMA1_CCP1                   ((uint32_t)0X0000000A)
#define IOMUX_PINCM40_PF_TIMG7_CCP1                   ((uint32_t)0X0000000B)

/* IOMUX_PINCM41[PF] Bits */
#define IOMUX_PINCM41_PF_UNCONNECTED                  ((uint32_t)0X00000000)
#define IOMUX_PINCM41_PF_GPIOA_DIO19                  ((uint32_t)0X00000001)
#define IOMUX_PINCM41_PF_DEBUGSS_SWDIO                ((uint32_t)0X00000002)
#define IOMUX_PINCM41_PF_SPI1_POCI                    ((uint32_t)0X00000003)
#define IOMUX_PINCM41_PF_I2C1_SDA                     ((uint32_t)0X00000004)
#define IOMUX_PINCM41_PF_TIMA0_CCP2                   ((uint32_t)0X00000005)
#define IOMUX_PINCM41_PF_TIMG0_CCP0                   ((uint32_t)0X00000006)

